Tekla Open API Reference for Tekla Structures 2025
ImageListComboBox Events
The ImageListComboBox type exposes the following members.
Events
Name | Description
ImageListComboBoxMouseWheel
 The ImageListComboBoxMouseWheel event is triggered just after the mouse wheel has been activated on top of the combo box.
ImageListComboBoxSelectedIndexChanged
 The ImageListComboBoxSelectedIndexChanged event is triggered just after the selected index has been changed in the image combo box.
Top
See Also
Reference
ImageListComboBox Class
Tekla.Structures.Dialog.UIControls Namespace